## DataFrame
##### rectangular table of hetrogeneous data and contains an ordered collection of columns(different types)
##### It has both row and column index
##### dictionary of series all sharing the same index
##### It is physically 2D but we can use it to make higher dimensional data in tabular format using hierarchical indexing.

In [1]:
import pandas as pd
import numpy as np

##### Constructing DataFrame
###### From dictionary

In [ ]:
data =

In [2]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003]}

In [3]:
pd.Series(data)

pop                  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
state    [Ohio, Ohio, Ohio, Nevada, Nevada, Nevada]
year           [2000, 2001, 2002, 2001, 2002, 2003]
dtype: object

In [4]:
data_df = pd.DataFrame(data)
data_df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [10]:
# No header
# pd.DataFrame(data,column=False)
data_df.columns

Index(['pop', 'state', 'year'], dtype='object')

In [6]:
data_df.columns = [0,1,2]
data_df.columns = ['Population','State','Year']
data_df

   Population   State  Year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002
5         3.2  Nevada  2003

In [15]:
# by default it will show for top 5 records
data_df.head()

   Population   State  Year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002

In [13]:
data_df.head(100)

   Population   State  Year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002
5         3.2  Nevada  2003

In [16]:
# by default it will show for bottop 5 records
data_df.tail()

   Population   State  Year
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002
5         3.2  Nevada  2003

In [17]:
data_df.tail(10)

   Population   State  Year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002
5         3.2  Nevada  2003

In [19]:
# Select 10 records from data frame
data_df.head(10)

   Population   State  Year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002
5         3.2  Nevada  2003

In [21]:
#data_df['Year']
data_df.Year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [22]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Population    6 non-null float64
State         6 non-null object
Year          6 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [7]:
data_df['Year'] = data_df['Year'].astype('object')
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Population    6 non-null float64
State         6 non-null object
Year          6 non-null object
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [26]:
# statistics part
data_df.describe()

       Population
count    6.000000
mean     2.550000
std      0.836062
min      1.500000
25%      1.875000
50%      2.650000
75%      3.125000
max      3.600000

In [29]:
data_df.head()

   Population   State  Year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002

In [28]:
# We can see DataFrame's column in order we want
data_df[['Year','Population','State']]

   Year  Population   State
0  2000         1.5    Ohio
1  2001         1.7    Ohio
2  2002         3.6    Ohio
3  2001         2.4  Nevada
4  2002         2.9  Nevada
5  2003         3.2  Nevada

In [30]:
data_df.index # Range(6)

RangeIndex(start=0, stop=6, step=1)

In [31]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003]}

In [8]:
# If we pass a column that is not contained in the dict, it will appear with missing value in the result4
data1 = pd.DataFrame(data,columns=['year','state','pop','debt'],index=['a','b','c','d','e','f'])
data1

   year   state  pop debt
a  2000    Ohio  1.5  NaN
b  2001    Ohio  1.7  NaN
c  2002    Ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN
f  2003  Nevada  3.2  NaN

In [35]:
data1.info() ## VVI info(), describe()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 4 columns):
year     6 non-null int64
state    6 non-null object
pop      6 non-null float64
debt     0 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 240.0+ bytes

In [37]:
# assigning 1 scalar values
data1['debt'] = 2
data1.head(100)

   year   state  pop  debt
a  2000    Ohio  1.5     2
b  2001    Ohio  1.7     2
c  2002    Ohio  3.6     2
d  2001  Nevada  2.4     2
e  2002  Nevada  2.9     2
f  2003  Nevada  3.2     2

In [9]:
data1['debt'] = range(6)
data1.head(10)

   year   state  pop  debt
a  2000    Ohio  1.5     0
b  2001    Ohio  1.7     1
c  2002    Ohio  3.6     2
d  2001  Nevada  2.4     3
e  2002  Nevada  2.9     4
f  2003  Nevada  3.2     5

In [39]:
data1.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [11]:
# To access records in DataFrame , use df.loc to access it.
data1.loc['d']

year       2001
state    Nevada
pop         2.4
debt          3
Name: d, dtype: object

In [12]:
data1.iloc[3]

year       2001
state    Nevada
pop         2.4
debt          3
Name: d, dtype: object

In [47]:
data1.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [50]:
data1.loc['d']['year']

2001

In [13]:
data1[data1['year']==2002]

   year   state  pop  debt
c  2002    Ohio  3.6     2
e  2002  Nevada  2.9     4

In [59]:
# How to replace values for a column through index in dataframe
data1.loc['e','year'] = 2003
data1

   year   state  pop  debt
a  2000    Ohio  1.5     0
b  2001    Ohio  1.7     1
c  2002    Ohio  3.6     2
d  2001  Nevada  2.4     3
e  2003  Nevada  2.9     4
f  2003  Nevada  3.2     5

In [15]:
data1.loc['d','pop'] = 2.6
data1

   year   state  pop  debt
a  2000    Ohio  1.5     0
b  2001    Ohio  1.7     1
c  2002    Ohio  3.6     2
d  2001  Nevada  2.6     3
e  2002  Nevada  2.9     4
f  2003  Nevada  3.2     5

In [5]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003]}

In [6]:
data_df = pd.DataFrame(data)
data_df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [7]:
data_df['debt'] = ''
data_df

   pop   state  year debt
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [8]:
# if we want to add new column , we should specify through df['column_name]. It can not be created through df.column_name
data_df.original = ''
data_df

In [14]:
data_df

   Population   State  Year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002
5         3.2  Nevada  2003

In [16]:
# If we want to assign the values in a column of dataframe , it should have the same length as dataframe index.
data_df['debt'] =  np.arange(3)
data_df

ValueError: Length of values does not match length of index

In [13]:
data_df.index

RangeIndex(start=0, stop=6, step=1)

##### If we want to assign series to a dataframe , values will get assigned according to index value. It checks index value

In [15]:
debt_val = pd.Series(data=[-1,2,3.9],index=[2,3,4])
debt_val

2   -1.0
3    2.0
4    3.9
dtype: float64

In [16]:
data_df['debt'] = debt_val
data_df

   pop   state  year  debt
0  1.5    Ohio  2000   NaN
1  1.7    Ohio  2001   NaN
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2  Nevada  2003   NaN

In [17]:
debt_val1 = pd.Series(data=[-1,2,3.9],index=[9,10,11])
debt_val1

9    -1.0
10    2.0
11    3.9
dtype: float64

In [18]:
data_df['debt1'] = debt_val1
data_df

   pop   state  year  debt  debt1
0  1.5    Ohio  2000   NaN    NaN
1  1.7    Ohio  2001   NaN    NaN
2  3.6    Ohio  2002  -1.0    NaN
3  2.4  Nevada  2001   2.0    NaN
4  2.9  Nevada  2002   3.9    NaN
5  3.2  Nevada  2003   NaN    NaN

In [19]:
# If we want to assign the values in a column of dataframe , it should have the same length as dataframe index.
data_df.debt2 = debt_val1
data_df

   pop   state  year  debt  debt1
0  1.5    Ohio  2000   NaN    NaN
1  1.7    Ohio  2001   NaN    NaN
2  3.6    Ohio  2002  -1.0    NaN
3  2.4  Nevada  2001   2.0    NaN
4  2.9  Nevada  2002   3.9    NaN
5  3.2  Nevada  2003   NaN    NaN

In [20]:
data_df.debt1

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: debt1, dtype: float64

###### Delete a column from data frame using del keyword
del df['column_name']

In [21]:
del data_df['debt1']

In [22]:
data_df.columns

Index(['pop', 'state', 'year', 'debt'], dtype='object')

In [25]:
# Creating a dataframe using nested dictionary, outer keys will be column name and inner keys will be index provided that we don't
# specify explicit index
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003]}

In [28]:
data1 = {'Nevada':{2001:3,2002:4,2003:5},
         'ohio': {2000:2,2001:5,2002:8}
        }
data1

{'Nevada': {2001: 3, 2002: 4, 2003: 5}, 'ohio': {2000: 2, 2001: 5, 2002: 8}}

In [29]:
df = pd.DataFrame(data1)
df

      Nevada  ohio
2000     NaN   2.0
2001     3.0   5.0
2002     4.0   8.0
2003     5.0   NaN

In [30]:
df1 = pd.DataFrame(data1,index=[0,1,2,3])
df1

   Nevada  ohio
0     NaN   NaN
1     NaN   NaN
2     NaN   NaN
3     NaN   NaN

In [31]:
df2 = pd.DataFrame(data1,index=[2001,2003,2002])
df2

      Nevada  ohio
2001       3   5.0
2003       5   NaN
2002       4   8.0

In [32]:
# Transposing of dataframe : df.T
df2.T

        2001  2003  2002
Nevada   3.0   5.0   4.0
ohio     5.0   NaN   8.0

In [34]:
df

      Nevada  ohio
2000     NaN   2.0
2001     3.0   5.0
2002     4.0   8.0
2003     5.0   NaN

In [33]:
df['ohio'][:2]

2000    2.0
2001    5.0
Name: ohio, dtype: float64

In [35]:
df['ohio'][:-1]

2000    2.0
2001    5.0
2002    8.0
Name: ohio, dtype: float64

In [38]:
df

      Nevada  ohio
2000     NaN   2.0
2001     3.0   5.0
2002     4.0   8.0
2003     5.0   NaN

##### convert dataframe to array 
It will convert into 2DArray.

In [37]:
df.values

array([[ nan,   2.],
       [  3.,   5.],
       [  4.,   8.],
       [  5.,  nan]])

In [41]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
pop      6 non-null float64
state    6 non-null object
year     6 non-null int64
debt     3 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 272.0+ bytes

In [42]:
data_df.values

array([[1.5, 'Ohio', 2000, nan],
       [1.7, 'Ohio', 2001, nan],
       [3.6, 'Ohio', 2002, -1.0],
       [2.4, 'Nevada', 2001, 2.0],
       [2.9, 'Nevada', 2002, 3.9],
       [3.2, 'Nevada', 2003, nan]], dtype=object)

#### Index Object

In [43]:
data_df.index

RangeIndex(start=0, stop=6, step=1)

In [49]:
index = debt_val.index
index

Int64Index([2, 3, 4], dtype='int64')

In [51]:
index[:2]

Int64Index([2, 3], dtype='int64')

In [54]:
obj = pd.Series([10,11,12],index= index)
obj

2    10
3    11
4    12
dtype: int64

In [56]:
obj1 = pd.Series([10,11,12],index= debt_val.index)
obj1

2    10
3    11
4    12
dtype: int64

In [58]:
obj1.index is index

True

In [61]:
np.in1d(obj1.index,index)

array([ True,  True,  True], dtype=bool)

In [60]:
'ohio' in data_df.columns

False

In [63]:
data_df.columns
df.columns

Index(['Nevada', 'ohio'], dtype='object')

In [64]:
'Nevada' in df.columns

True

In [68]:
labels = pd.Index([2001,2002,2003,2001])
labels

Int64Index([2001, 2002, 2003, 2001], dtype='int64')

In [66]:
data1

{'Nevada': {2001: 3, 2002: 4, 2003: 5}, 'ohio': {2000: 2, 2001: 5, 2002: 8}}

###### unline python sets, a pandas index can contain duplicate labels
So dataframe can also contain duplicate index provided you specify it.

In [69]:
new_df = pd.DataFrame(data1,index=labels)
new_df

      Nevada  ohio
2001       3   5.0
2002       4   8.0
2003       5   NaN
2001       3   5.0

## Reindexing
Calling reindex() on the series, rearrages the data according to new index. For new index which was not there earlier, NaN will appear.

In [1]:
obj = pd.Series([3,4,5,2,1],index=['c','d','e','b','a'])
obj

NameError: name 'pd' is not defined

In [72]:
obj2 = obj.reindex(['a','b','c','d','e','f'])
obj2

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
dtype: float64

In [74]:
obj3 = pd.Series(['white','black','brown'],index=[0,2,4])
obj3

0    white
2    black
4    brown
dtype: object

In [75]:
# ffill method -> takes values from upper element and place it the gap down
obj3.reindex(range(6),method='ffill') # copy , not affecting original series obj3

0    white
1    white
2    black
3    black
4    brown
5    brown
dtype: object

In [76]:
obj3

0    white
2    black
4    brown
dtype: object

In [77]:
# bfill:- takes value from lower element and fill it up. 
obj3.reindex(range(6),method='bfill')

0    white
1    black
2    black
3    brown
4    brown
5      NaN
dtype: object

## Dropping entries from an Axis

In [78]:
obj

c    3
d    4
e    5
b    2
a    1
dtype: int64

In [79]:
obj.drop('c')

d    4
e    5
b    2
a    1
dtype: int64

In [80]:
obj

c    3
d    4
e    5
b    2
a    1
dtype: int64

In [81]:
obj.drop('c',inplace=True)
obj

d    4
e    5
b    2
a    1
dtype: int64

In [82]:
obj.drop(['a','b'])

d    4
e    5
dtype: int64

In [83]:
data_df

   pop   state  year  debt
0  1.5    Ohio  2000   NaN
1  1.7    Ohio  2001   NaN
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2  Nevada  2003   NaN

In [84]:
data_df['debt1'] = 2
data_df

   pop   state  year  debt  debt1
0  1.5    Ohio  2000   NaN      2
1  1.7    Ohio  2001   NaN      2
2  3.6    Ohio  2002  -1.0      2
3  2.4  Nevada  2001   2.0      2
4  2.9  Nevada  2002   3.9      2
5  3.2  Nevada  2003   NaN      2

In [89]:
data_df.drop([0,1]) # droping record from dataframe based on index

   pop   state  year  debt  debt1
2  3.6    Ohio  2002  -1.0      2
3  2.4  Nevada  2001   2.0      2
4  2.9  Nevada  2002   3.9      2
5  3.2  Nevada  2003   NaN      2

In [90]:
data_df

   pop   state  year  debt  debt1
0  1.5    Ohio  2000   NaN      2
1  1.7    Ohio  2001   NaN      2
2  3.6    Ohio  2002  -1.0      2
3  2.4  Nevada  2001   2.0      2
4  2.9  Nevada  2002   3.9      2
5  3.2  Nevada  2003   NaN      2

In [91]:
data_df.drop([0,1],inplace=True)
data_df

   pop   state  year  debt  debt1
2  3.6    Ohio  2002  -1.0      2
3  2.4  Nevada  2001   2.0      2
4  2.9  Nevada  2002   3.9      2
5  3.2  Nevada  2003   NaN      2

In [92]:
data_df.drop(['debt1'],axis=1)

   pop   state  year  debt
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2  Nevada  2003   NaN

In [93]:
data_df

   pop   state  year  debt  debt1
2  3.6    Ohio  2002  -1.0      2
3  2.4  Nevada  2001   2.0      2
4  2.9  Nevada  2002   3.9      2
5  3.2  Nevada  2003   NaN      2

In [94]:
data_df.drop(['debt1'],axis=1,inplace=True)
data_df

   pop   state  year  debt
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2  Nevada  2003   NaN

In [96]:
data_df['debt2'] = ''
data_df['debt3'] = ''
data_df

   pop   state  year  debt debt2 debt3
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2  Nevada  2003   NaN

In [97]:
data_df.drop(['debt2','debt3'],axis='columns',inplace=True)
data_df

   pop   state  year  debt
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2  Nevada  2003   NaN

### Indexing, Selection and Filtering

In [98]:
obj

d    4
e    5
b    2
a    1
dtype: int64

In [99]:
obj[2:4]

b    2
a    1
dtype: int64

In [101]:
obj['d':'b']

d    4
e    5
b    2
dtype: int64

In [102]:
obj['d':'e'] = 6
obj

d    6
e    6
b    2
a    1
dtype: int64

In [103]:
data_df

   pop   state  year  debt
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2  Nevada  2003   NaN

In [107]:
data_df.loc[5]

pop         3.2
state    Nevada
year       2003
debt        NaN
Name: 5, dtype: object

In [111]:
data_df.loc[5,'state']='Ohio'
data_df

   pop   state  year  debt
2  3.6    Ohio  2002  -1.0
3  2.4  Nevada  2001   2.0
4  2.9  Nevada  2002   3.9
5  3.2    Ohio  2003   NaN

In [114]:
data_df[2:4]

   pop   state  year  debt
4  2.9  Nevada  2002   3.9
5  3.2    Ohio  2003   NaN

In [5]:
data_df.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [8]:
data1 = data_df.copy()
data1

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [9]:
data2 = data_df
data2

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [12]:
data2.drop(['year'],axis=1,inplace=True)
data2

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [13]:
data_df

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [15]:
data1.drop(['state'],axis=1,inplace=True)
data1

   pop  year
0  1.5  2000
1  1.7  2001
2  3.6  2002
3  2.4  2001
4  2.9  2002
5  3.2  2003

In [16]:
data_df

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [18]:
data_df = pd.DataFrame(data)
data_df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [19]:
data_df.loc[2,['year']]

year    2002
Name: 2, dtype: object

In [20]:
data_df.loc[2,['year','state']]

year     2002
state    Ohio
Name: 2, dtype: object

In [24]:
data_df.index= ['a','b','c','d','e','f']
data_df

   pop   state  year
a  1.5    Ohio  2000
b  1.7    Ohio  2001
c  3.6    Ohio  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002
f  3.2  Nevada  2003

##### loc(axis label) works on index labels not on position. iloc (integer axis label) works on position not on index label.

In [26]:
data_df.loc['c',['year']]

year    2002
Name: c, dtype: object

In [27]:
data_df.iloc[2,[0,1]]

pop       3.6
state    Ohio
Name: c, dtype: object

In [31]:
data_df.iloc[2,[0,1]] = [3,'Nevada']
data_df

   pop   state  year
a  1.5    Ohio  2000
b  1.7    Ohio  2001
c  3.0  Nevada  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002
f  3.2  Nevada  2003

In [32]:
data_df.loc['b',['state','year']] = [3.6,'Ohio']
data_df

   pop   state  year
a  1.5    Ohio  2000
b  1.7     3.6  Ohio
c  3.0  Nevada  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002
f  3.2  Nevada  2003

In [35]:
data_df.iloc[:2,[1]]

  state
a  Ohio
b   3.6

In [36]:
data_df.at['a','state'] # return a single scalar value based on row and column label

'Ohio'

In [38]:
data_df.iat[0,1] # returns a single scalar value based on row and column position.

'Ohio'

In [42]:
data_df.iloc[:1]

   pop state  year
a  1.5  Ohio  2000

In [43]:
data_df.iloc[[0,2,3],[0,1]]

   pop   state
a  1.5    Ohio
c  3.0  Nevada
d  2.4  Nevada

In [44]:
data_df.iloc[[0,2,3],:]

   pop   state  year
a  1.5    Ohio  2000
c  3.0  Nevada  2002
d  2.4  Nevada  2001

##### Arithmetic and Data Alignment

In [17]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('abc'),index=['Tamilnadu','Andhra','Karnataka'])
df1

           a  b  c
Tamilnadu  0  1  2
Andhra     3  4  5
Karnataka  6  7  8

In [18]:
df2 = pd.DataFrame(np.arange(12).reshape(4,3),columns= list('bcd'),index=['Karnataka','Andhra','Kerala','Delhi'])
df2

           b   c   d
Karnataka  0   1   2
Andhra     3   4   5
Kerala     6   7   8
Delhi      9  10  11

In [19]:
df1+df2

            a    b    c   d
Andhra    NaN  7.0  9.0 NaN
Delhi     NaN  NaN  NaN NaN
Karnataka NaN  7.0  9.0 NaN
Kerala    NaN  NaN  NaN NaN
Tamilnadu NaN  NaN  NaN NaN

In [20]:
df1-df2

            a    b    c   d
Andhra    NaN  1.0  1.0 NaN
Delhi     NaN  NaN  NaN NaN
Karnataka NaN  7.0  7.0 NaN
Kerala    NaN  NaN  NaN NaN
Tamilnadu NaN  NaN  NaN NaN

In [51]:
print(df1.head(),'\n',df2.head())
df1.add(df2,fill_value=0)

           a  b  c
Tamilnadu  0  1  2
Andhra     3  4  5
Karnataka  6  7  8
            b   c   d
Karnataka  0   1   2
Andhra     3   4   5
Kerala     6   7   8
Delhi      9  10  11

             a    b     c     d
Andhra     3.0  7.0   9.0   5.0
Delhi      NaN  9.0  10.0  11.0
Karnataka  6.0  7.0   9.0   2.0
Kerala     NaN  6.0   7.0   8.0
Tamilnadu  0.0  1.0   2.0   NaN

             a    b     c     d
Andhra     3.0  7.0   9.0   5.0
Delhi      NaN  9.0  10.0  11.0
Karnataka  6.0  7.0   9.0   2.0
Kerala     NaN  6.0   7.0   8.0
Tamilnadu  0.0  1.0   2.0   NaN

In [56]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[3,4]})
df1.head()

   A
0  1
1  2

In [57]:
df2.head()

   B
0  3
1  4

In [58]:
df1.add(df2)

    A   B
0 NaN NaN
1 NaN NaN

In [79]:
df1.add(df2,fill_value=0)

     A    B
0  1.0  3.0
1  2.0  4.0

In [80]:
df1.add(df2,fill_value=0,axis='index')

     A    B
0  1.0  3.0
1  2.0  4.0

In [64]:
df1.sub(df2,fill_value=0)

     A    B
0  1.0 -3.0
1  2.0 -4.0

In [65]:
df1.div(df2,fill_value=1)

     A         B
0  1.0  0.333333
1  2.0  0.250000

In [66]:
df1.div(df2,fill_value=0)

     A    B
0  inf  0.0
1  inf  0.0

In [68]:
df1.mul(df2,fill_value=2)

     A    B
0  2.0  6.0
1  4.0  8.0

#### Operation between DataFrame and Series
Like Numpy broadcasting, 2Darray each element will be operated with 1darray.

In [71]:
data1 = pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8],'C':[9,10,11,12]})
data1.head()

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [74]:
s1 = data1.iloc[0]
s1

A    1
B    5
C    9
Name: 0, dtype: int64

In [75]:
type(s1)

pandas.core.series.Series

In [76]:
data1+s1

   A   B   C
0  2  10  18
1  3  11  19
2  4  12  20
3  5  13  21

In [77]:
data1.add(s1)

   A   B   C
0  2  10  18
1  3  11  19
2  4  12  20
3  5  13  21

In [88]:
data1.add(s1,axis='index')

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN

#### Sorting and Ranking
###### sort_index(): sorts based on index
###### sort_values(): sorts based on column values

In [90]:
data_df = data_df.reindex(index=['f','d','e','b','c','a'])
data_df

   pop   state  year
f  3.2  Nevada  2003
d  2.4  Nevada  2001
e  2.9  Nevada  2002
b  1.7     3.6  Ohio
c  3.0  Nevada  2002
a  1.5    Ohio  2000

In [91]:
data_df.sort_index() # by default in ascending order

   pop   state  year
a  1.5    Ohio  2000
b  1.7     3.6  Ohio
c  3.0  Nevada  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002
f  3.2  Nevada  2003

In [92]:
data_df.sort_index(ascending=False)

   pop   state  year
f  3.2  Nevada  2003
e  2.9  Nevada  2002
d  2.4  Nevada  2001
c  3.0  Nevada  2002
b  1.7     3.6  Ohio
a  1.5    Ohio  2000

In [94]:
data_df = data_df.sort_index() # to reflect in original dataframe
data_df

   pop   state  year
a  1.5    Ohio  2000
b  1.7     3.6  Ohio
c  3.0  Nevada  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002
f  3.2  Nevada  2003

In [95]:
data_df.sort_values(by='pop')

   pop   state  year
a  1.5    Ohio  2000
b  1.7     3.6  Ohio
d  2.4  Nevada  2001
e  2.9  Nevada  2002
c  3.0  Nevada  2002
f  3.2  Nevada  2003

In [97]:
data_df.iloc[1,[1,2]] = ['Ohio',2000]
data_df

   pop   state  year
a  1.5    Ohio  2000
b  1.7    Ohio  2000
c  3.0  Nevada  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002
f  3.2  Nevada  2003

In [99]:
data_df.sort_values(by='year',inplace=True)
data_df

   pop   state  year
a  1.5    Ohio  2000
b  1.7    Ohio  2000
d  2.4  Nevada  2001
c  3.0  Nevada  2002
e  2.9  Nevada  2002
f  3.2  Nevada  2003

##### Ranking
Ranking assigns ranks from 1 through the no. of valid data points in an array. 
by default , it works mean rank.

In [100]:
s1 = pd.Series([7,-5,7,4,2,0,4])
s1

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [101]:
s1.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [102]:
s1.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [103]:
s1.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [104]:
print(s1)
s1.rank(method='first')

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [105]:
data_df

   pop   state  year
a  1.5    Ohio  2000
b  1.7    Ohio  2000
d  2.4  Nevada  2001
c  3.0  Nevada  2002
e  2.9  Nevada  2002
f  3.2  Nevada  2003

In [109]:
data1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [112]:
data1.loc[2,:] = [1.9,5.5,9.5]
data1

     A    B     C
0  1.0  5.0   9.0
1  2.0  6.0  10.0
2  1.9  5.5   9.5
3  4.0  8.0  12.0

In [113]:
data1.rank()  # by default axis =0

     A    B    C
0  1.0  1.0  1.0
1  3.0  3.0  3.0
2  2.0  2.0  2.0
3  4.0  4.0  4.0

In [115]:
data1.rank(axis=1)

     A    B    C
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0
3  1.0  2.0  3.0

##### Descriptive Statistics

In [116]:
data1.describe()

              A         B          C
count  4.000000  4.000000   4.000000
mean   2.225000  6.125000  10.125000
std    1.265899  1.314978   1.314978
min    1.000000  5.000000   9.000000
25%    1.675000  5.375000   9.375000
50%    1.950000  5.750000   9.750000
75%    2.500000  6.500000  10.500000
max    4.000000  8.000000  12.000000

In [117]:
data1.mean()

A     2.225
B     6.125
C    10.125
dtype: float64

In [118]:
data1.sum()

A     8.9
B    24.5
C    40.5
dtype: float64

In [119]:
data1.max()

A     4.0
B     8.0
C    12.0
dtype: float64

In [120]:
data1.min()

A    1.0
B    5.0
C    9.0
dtype: float64

In [121]:
data1.cumsum()

     A     B     C
0  1.0   5.0   9.0
1  3.0  11.0  19.0
2  4.9  16.5  28.5
3  8.9  24.5  40.5

In [122]:
data1.cumsum(axis=1)

     A     B     C
0  1.0   6.0  15.0
1  2.0   8.0  18.0
2  1.9   7.4  16.9
3  4.0  12.0  24.0

In [123]:
data1.cumprod()

      A       B        C
0   1.0     5.0      9.0
1   2.0    30.0     90.0
2   3.8   165.0    855.0
3  15.2  1320.0  10260.0

In [124]:
data1.median()

A    1.95
B    5.75
C    9.75
dtype: float64

In [126]:
print(data1,'\n')
data1.pct_change()

     A    B     C
0  1.0  5.0   9.0
1  2.0  6.0  10.0
2  1.9  5.5   9.5
3  4.0  8.0  12.0

          A         B         C
0       NaN       NaN       NaN
1  1.000000  0.200000  0.111111
2 -0.050000 -0.083333 -0.050000
3  1.105263  0.454545  0.263158

In [127]:
data1.corr() # correlation

          A         B         C
A  1.000000  0.988709  0.988709
B  0.988709  1.000000  1.000000
C  0.988709  1.000000  1.000000

In [133]:
data1.corrwith(data1['A']) # covariance

A    1.000000
B    0.988709
C    0.988709
dtype: float64

In [129]:
data1['A'].value_counts()

1.9    1
4.0    1
2.0    1
1.0    1
Name: A, dtype: int64

In [131]:
data1['A'].unique()

array([ 1. ,  2. ,  1.9,  4. ])